tap "adoptopenjdk/openjdk"
tap "databricks/tap"
tap "dtan4/tools"
tap "homebrew/services"
tap "mike-engel/jwt-cli"
tap "octoenergy/kraken-cli", "git@github.com:octoenergy/kraken-cli.git"
tap "octoenergy/ktl-data-cli", "git@github.com:octoenergy/ktl-data-cli.git"
tap "peak/tap"
brew "glib"
brew "cairo"
brew "harfbuzz"
brew "xz"
brew "libtiff"
brew "openjdk"
brew "ammonite-repl"
brew "awscli"
brew "libgit2"
brew "bat"
brew "circleci"
brew "cowsay"
brew "docker-completion"
brew "duckdb"
brew "eza"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "helm"
brew "htop"
brew "hugo"
brew "jabba"
brew "jq"
brew "kafka"
brew "kubernetes-cli"
brew "kubectx"
brew "libgit2@1.7"
brew "neovim"
brew "node"
brew "opentofu"
brew "pipenv"
brew "pipx"
brew "postgresql@15"
brew "pstree"
brew "pyenv"
brew "pyenv-virtualenv"
brew "ripgrep"
brew "scala@2.12"
brew "tfenv"
brew "tlrc"
brew "tmux"
brew "tree"
brew "watch"
brew "wget"
brew "yarn"
brew "yq"
brew "zlib"
brew "databricks/tap/databricks"
brew "dtan4/tools/k8sec"
brew "mike-engel/jwt-cli/jwt-cli"
brew "octoenergy/kraken-cli/kraken-cli"
brew "peak/tap/s5cmd"
cask "1password-cli"
cask "aws-vault"
cask "dbeaver-community"
cask "discord"
cask "docker"
cask "eudic"
cask "franz"
cask "google-drive"
cask "hiddenbar"
cask "istat-menus"
cask "logi-options+"
cask "meld"
cask "postgres-unofficial"
cask "snipaste"
cask "spotify"
cask "sublime-text"
vscode "adpyke.vscode-sql-formatter"
vscode "alexanderbast.vscode-snazzy"
vscode "batisteo.vscode-django"
vscode "bigonesystems.django"
vscode "docker.docker"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "johnpapa.winteriscoming"
vscode "kaiwood.center-editor-window"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestaticwebapps"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "njpwerner.autodocstring"
vscode "paiqo.databricks-vscode"
vscode "pkief.material-icon-theme"
vscode "randomfractalsinc.vscode-data-table"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "samuelcolvin.jinjahtml"
vscode "sdras.night-owl"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "techer.open-in-browser"
vscode "trixnz.go-to-method"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "zxh404.vscode-proto3"
